'''
Приветствуем вас в чате комьюнити Undertale и Deltarune (http://t.me/utdrcommunity)! (16+)

В каждом чате действуют правила, и у нас они тоже есть, поэтому, пожалуйста, ознакомьтесь перед началом общения:
1.1. Запрещается разведение конфликтов с переходами на личности. Вы можете смело вести дискуссии и спорить, но полноценные срачи с оскорблениями караются варном и мутом на 12 часов.
1.2. Запрещается любое проявление неуважения к участникам чата и его администрации. Сюда входят:
→ оскорбления, насмешки и пожелания убиться (если они не в шутку);
→ намеренный миспронаунсинг (использование к человеку неверных местоимений);
→ все виды дискриминации (гомо/трансфобия, расизм, сексизм, шовинизм и прочее);
→ негативные реакции на чужие сообщения;
→ осуждение чужих интересов, фандомов, хобби и т.д.
Нарушение карается варном.
1.3. В то время, как мы не запрещаем квирфобам находиться в чате, любые проявления вашей неприязни будут наказываться варном.
1.4. Такие темы, как политика и религия, являются очень спорными и могут повлечь за собой множество нежеланных конфликтов, поэтому их обсуждение запрещено.

2.1. Спам запрещён в любой форме и будет караться варном. Если после варна человек не остановился — мут на 6 часов.
Что собой подразумевает спам:
→ отправка более 3 стикеров/гифок подряд;
→ излишнее использование таких команд Ириса, как дуэли, русская рулетка, «шипперим» и «ирис кто […]» (команды могут быть отключены модератором, если участники его не слушают);
→ излишнее использование бота @HowYourBot;
→ спам текстами и копипастами.

3.1. NSFW-контент разрешается кидать исключительно под спойлером и с соответствующим предупреждением. Ввиду того, что стикеры и гифки не могут быть скрыты, их отправка запрещается. За нарушение модератор просто попросит вас поставить спойлер и предупреждение, однако если вы проигнорируете, сообщение будет удалено, а вы получите варн. Текстовые сообщения тоже к этому относятся! (но только если вы конкретно детализируете. если это простые «трахнуть/выебать», можно кидать и без спойлера)
3.2. Однако, ни в каком виде нельзя присылать NSFW-контент с реальными людьми, а также с персонажами, которым в каноне не исполнилось 18. Ровно так же нельзя и выражать желание трахнуть их!!!

4.1. Реклама любых проектов запрещена (если вы предварительно не получили разрешение от модераторов). Для каналов можно просто запросить взаимный пиар с @utdrcommunity под специальным постом! Нарушение карается варном, а если вы продолжите, то мутом на 6 часов.
4.2. Если вдруг вам что-то рекламируют в лс и этот человек является участником чата, напишите модераторам. Пиар участникам в лс считается обхождением правила 4.1 и тоже карается варном.

5.1. Во время выхода новых глав Дельтаруна в чате на некоторое время (будет объявляться) действует антиспойлерный режим. Это подразумевает собой, что очевидно, запрет на спойлеры, даже самые незначительные. Любые сообщения, арты и медиа должны блюриться. При нескольких нарушениях вас просто попросят заблюрить спойлеры, но при многократных следует варн на одну неделю.

6.1. Хоть это и не рекомендуется ввиду того, что все люди в чате незнакомые, вент (небольшой!!!) не запрещается. Если у вас есть какие-либо проблемы и вы доверяете присутствующим в чате, дерзайте.
Однако, если вы собираетесь упоминать селфхарм, суицид и прочее, то НЕ НАДО делиться этим в чате, чтобы никого не триггернуть, а также ради вашей же безопасности. Люди могут нести чушь и советовать не самые лучшие вещи, поэтому лучше обратиться к специалисту или близким, которым вы уже точно доверяете на все 100.
6.2. Осуждение чужих проблем и потенциально вредоносные комментарии и советы караются варном и удалением сообщения.

ВСЕ ВАРНЫ (кроме выданных за правило 5.1) ПЕРМАНЕНТНЫЕ!!! За три варна вам будет выдан бан, который через 3 месяца можно будет оспорить в специальном боте (http://t.me/utdrbanappeals_bot).
Если вам довелось увидеть, как кто-то нарушает правила, немедленно пингуйте любого модератора в сети или используйте команду «!репорт».
Правила могут обновляться со временем!
'''

rules = {
    '1.1': 'ПРАВИЛО 1.1.\n<blockquote>Запрещается разведение конфликтов с переходами на личности. Вы можете смело вести дискуссии и спорить, но полноценные срачи с оскорблениями караются варном и мутом на 12 часов.</blockquote>',
    '1.2': '''ПРАВИЛО 1.2.
<blockquote>Запрещается любое проявление неуважения к участникам чата и его администрации. Сюда входят:
→ оскорбления, насмешки и пожелания убиться (если они не в шутку);
→ намеренный миспронаунинг (использование к человеку неверных местоимений);
→ все виды дискриминации (гомо/трансфобия, расизм, сексизм, шовинизм и прочее);
→ негативные реакции на чужие сообщения;
→ осуждение чужих интересов, фандомов, хобби и т.д.
Нарушение карается варном.</blockquote>''',
    '1.3': 'ПРАВИЛО 1.3.\n<blockquote>В то время, как мы не запрещаем квирфобам находиться в чате, любые проявления вашей неприязни будут наказываться варном.</blockquote>',
    '1.4': 'ПРАВИЛО 1.4.\n<blockquote>Такие темы, как политика и религия, являются очень спорными и могут повлечь за собой множество нежеланных конфликтов, поэтому их обсуждение запрещено.</blockquote>',

    '2.1': '''ПРАВИЛО 2.1.<blockquote>Спам запрещён в любой форме и будет караться варном. Если после варна человек не остановился — мут на 6 часов.
Что собой подразумевает спам:
→ отправка более 3 стикеров/гифок подряд;
→ излишнее использование таких команд Ириса, как дуэли, русская рулетка, «шипперим» и «ирис кто […]» (команды могут быть отключены модератором, если участники его не слушают);
→ излишнее использование бота @HowYourBot;
→ спам текстами и копипастами.</blockquote>''',

    '3.1': 'ПРАВИЛО 3.1.\n<blockquote>NSFW-контент разрешается кидать исключительно под спойлером и с соответствующим предупреждением. Ввиду того, что стикеры и гифки не могут быть скрыты, их отправка запрещается. За нарушение модератор просто попросит вас поставить спойлер и предупреждение, однако если вы проигнорируете, сообщение будет удалено, а вы получите варн. Текстовые сообщения тоже к этому относятся! (но только если вы конкретно детализируете. если это простые «трахнуть/выебать», можно кидать и без спойлера)</blockquote>',
    '3.2': 'ПРАВИЛО 3.2.\n<blockquote>Однако, ни в каком виде нельзя присылать NSFW-контент с реальными людьми, а также с персонажами, которым в каноне не исполнилось 18. Ровно так же нельзя и выражать желание трахнуть их!!!</blockquote>',

    '4.1': 'ПРАВИЛО 4.1.\n<blockquote>Реклама любых проектов запрещена (если вы предварительно не получили разрешение от модераторов). Для каналов можно просто запросить взаимный пиар с @utdrcommunity под специальным постом! Нарушение карается варном, а если вы продолжите, то мутом на 6 часов.</blockquote>',
    '4.2': 'ПРАВИЛО 4.2.\n<blockquote>Если вдруг вам что-то рекламируют в лс и этот человек является участником чата, напишите модераторам. Пиар участникам в лс считается обхождением правила 4.1 и тоже карается варном.</blockquote>',

    '5.1': 'ПРАВИЛО 5.1.\n<blockquote>Во время выхода новых глав Дельтаруна в чате на некоторое время (будет объявляться) действует антиспойлерный режим. Это подразумевает собой, что очевидно, запрет на спойлеры, даже самые незначительные. Любые сообщения, арты и медиа должны блюриться. При нескольких нарушениях вас просто попросят заблюрить спойлеры, но при многократных следует варн на одну неделю.</blockquote>',

    '6.1': '''ПРАВИЛО 6.1.<blockquote>Хоть это и не рекомендуется ввиду того, что все люди в чате незнакомые, вент (небольшой!!!) не запрещается. Если у вас есть какие-либо проблемы и вы доверяете присутствующим в чате, дерзайте.
Однако, если вы собираетесь упоминать селфхарм, суицид и прочее, то НЕ НАДО делиться этим в чате, чтобы никого не триггернуть, а также ради вашей же безопасности. Люди могут нести чушь и советовать не самые лучшие вещи, поэтому лучше обратиться к специалисту или близким, которым вы уже точно доверяете на все 100.</blockquote>''',
    '6.2': 'ПРАВИЛО 6.2.\n<blockquote>Осуждение чужих проблем и потенциально вредоносные комментарии и советы караются варном и удалением сообщения.</blockquote>',

    '7.1': 'ПРАВИЛО 7.1.\n<blockquote>ъ</blockquote>',

    '17': '''♏️■⧫❒⍓ ■◆❍♌️♏️❒ ⬧♏️❖♏️■⧫♏️♏️■
♎️♋️❒🙵 ♎️♋️❒🙵♏️❒ ⍓♏️⧫ ♎️♋️❒🙵♏️❒
⧫♒️♏️ ♎️♋️❒🙵■♏️⬧⬧ 🙵♏️♏️◻️⬧ ♑️❒□⬥♓️■♑️
⧫♒️♏️ ⬧♒️♋️♎️□⬥⬧ ♍️◆⧫⧫♓️■♑️ ♎️♏️♏️◻️♏️❒
◻️♒️□⧫□■ ❒♏️♋️♎️♓️■♑️⬧ ■♏️♑️♋️⧫♓️❖♏️
⧫♒️♓️⬧ ■♏️⌧⧫ ♏️⌧◻️♏️❒♓️❍♏️■⧫
⬧♏️♏️❍⬧
❖♏️❒⍓
❖♏️❒⍓
♓️■⧫♏️❒♏️⬧⧫♓️■♑️
📬📬📬
⬥♒️♋️⧫ ♎️□ ⍓□◆ ⧫⬥□ ⧫♒️♓️■🙵''',
    '34': 'ПРАВИЛО 34.\n<blockquote>ОНО У МЕНЯ НЕ СОХРАНЕНО, ТАК КАК ОНО ИЗВЕСТНО ВСЕМ.\nЧТОБЫ НАЙТИ ЕГО, ВБЕЙ В ГУГЛ "ГАСТЕР ПРАВИЛО 34"</blockquote>',
    '69': 'ПАСХАЛКА.',
    '264': '''♏️■⧫❒⍓ ■◆❍♌️♏️❒ ⬧♏️❖♏️■⧫♏️♏️■
♎️♋️❒🙵 ♎️♋️❒🙵♏️❒ ⍓♏️⧫ ♎️♋️❒🙵♏️❒
⧫♒️♏️ ♎️♋️❒🙵■♏️⬧⬧ 🙵♏️♏️◻️⬧ ♑️❒□⬥♓️■♑️
⧫♒️♏️ ⬧♒️♋️♎️□⬥⬧ ♍️◆⧫⧫♓️■♑️ ♎️♏️♏️◻️♏️❒
◻️♒️□⧫□■ ❒♏️♋️♎️♓️■♑️⬧ ■♏️♑️♋️⧫♓️❖♏️
⧫♒️♓️⬧ ■♏️⌧⧫ ♏️⌧◻️♏️❒♓️❍♏️■⧫
⬧♏️♏️❍⬧
❖♏️❒⍓
❖♏️❒⍓
♓️■⧫♏️❒♏️⬧⧫♓️■♑️
📬📬📬
⬥♒️♋️⧫ ♎️□ ⍓□◆ ⧫⬥□ ⧫♒️♓️■🙵''',
    '420': 'УНИКАЛЬНЫЕ\nЛИСТЬЯ.',
    '1225': 'ПАСХАЛКА.',
    '1488': 'ПАСХАЛКА.'
}