contains_triggers = {
    "ааа женщина": "ОЧЕНЬ\nИНТЕРЕСНО.",
    "многа букав": "ОЧЕНЬ\nИНТЕРЕСНО.",
    "много букв": "ОЧЕНЬ\nИНТЕРЕСНО.",
    "много букав": "ОЧЕНЬ\nИНТЕРЕСНО.",
    "лень читать": "ОЧЕНЬ\nИНТЕРЕСНО.",
    "driving in my car🚗, right after a beer🍺": "КАНОНИЧЕСКОЕ\nСОБЫТИЕ.",
    "я не понимаю почему многие жалеют крис": "ПОЛНОСТЬЮ\nС ВАМИ\nСОГЛАСЕН.",
    "человек яйца": "ЕГО\nЗОВУТ\n\"ЗАБЫТЫЙ ЧЕЛОВЕК\".",
    "человек-яйца": "ЕГО\nЗОВУТ\n\"ЗАБЫТЫЙ ЧЕЛОВЕК\".",
    "дессриэль": "ДЕССРИЭЛЬ\nКАНОН."
}

matches_triggers = {
    "test": "ТЕСТ ПРОЙДЕН.",
    "тест": "ТЕСТ ПРОЙДЕН.",
    "бот": "НА МЕСТЕ.",
    "гастер": "НА МЕСТЕ.",
    "гасир": "НА МЕСТЕ.",
    "гасер": "НА МЕСТЕ.",
    "убежище": "Я В НЁМ ЖИВУ.",
    "гастрит": "МЕНЯ\nНЕ ТАК ЗОВУТ."
}


admin_action_triggers = {
    "варн": "КАК ЖАЛЬ ЧТО\nУЧАСТНИКИ ЭКСПЕРИМЕНТА\nРУШАТ ЕГО ПОРЯДОК.",
    "снять варн": "ОЧЕНЬ ИНТЕРЕСНОЕ ПОВЕДЕНИЕ.",
    "мут": "КАЖЕТСЯ, КТО-ТО СОРВАЛ ГОЛОС.\nВОЗВРАЩАЙСЯ, КОГДА БУДЕШЬ,\nМММ... ПОСПОКОЙНЕЙ.",
    "бан": "НЕКОТОРЫМ\nК СОЖАЛЕНИЮ\nЛУЧШЕ НЕ УЧАВСТВОВАТЬ В ЭКСПЕРИМЕНТЕ."
}

channel_post_triggers = {
    "загор": "КАКАЯ ИНТЕРЕСНАЯ\nТЕОРИЯ.\n\"ЗАГОР\".\n\nМНЕ С НИМ\nЕЩЁ ПРЕДСТОИТ\nПОВИДАТЬСЯ."
}