contains_triggers = {
    "ааа женщина": "ОЧЕНЬ\nИНТЕРЕСНО.",
    "многа букав": "ОЧЕНЬ\nИНТЕРЕСНО.",
    "много букв": "ОЧЕНЬ\nИНТЕРЕСНО.",
    "много букав": "ОЧЕНЬ\nИНТЕРЕСНО.",
    "лень читать": "ОЧЕНЬ\nИНТЕРЕСНО.",
    "driving in my car🚗, right after a beer🍺": "КАНОНИЧЕСКОЕ\nСОБЫТИЕ.",
    "я не понимаю почему многие жалеют крис": "ПОЛНОСТЬЮ\nС ВАМИ\nСОГЛАСЕН.",
    "человек яйца": "ЕГО\nЗОВУТ\n\"ЗАБЫТЫЙ ЧЕЛОВЕК\".",
    "человек-яйца": "ЕГО\nЗОВУТ\n\"ЗАБЫТЫЙ ЧЕЛОВЕК\".",
    "дессриэль": "ДЕССРИЭЛЬ\nКАНОН.",
    "дессриэли": "ДЕССРИЭЛЬ\nКАНОН.",
    "крюзи": "КРЮЗИ\nКАНОН.",
    "крузи": "КРЮЗИ\nКАНОН.",
    "кердли": "ФУ\nБЛЯДЬ.",
    "нуберт": "НУБЕРТ\nКРУТОЙ.",
    "убежище": "Я В НЁМ ЖИВУ.",
    "др рп": "НАШ СЕРВЕР:\nhttps://www.roblox.com/share?code=b01c5b9a6e97114ea80908cc1225e39d&type=Server",

    "уникальные листья": "УНИКАЛЬНЫЕ ЛИСТЬЯ\nПРЕДНАЗНАЧЕНЫ\nТОЛЬКО\nДЛЯ ДЕСЕМБЕР\nИ АЗРИЭЛЯ.",
    "уникальных листьев": "УНИКАЛЬНЫЕ ЛИСТЬЯ\nПРЕДНАЗНАЧЕНЫ\nТОЛЬКО\nДЛЯ ДЕСЕМБЕР\nИ АЗРИЭЛЯ.",
    "уникальным листьям": "УНИКАЛЬНЫЕ ЛИСТЬЯ\nПРЕДНАЗНАЧЕНЫ\nТОЛЬКО\nДЛЯ ДЕСЕМБЕР\nИ АЗРИЭЛЯ.",
    "уникальными листьями": "УНИКАЛЬНЫЕ ЛИСТЬЯ\nПРЕДНАЗНАЧЕНЫ\nТОЛЬКО\nДЛЯ ДЕСЕМБЕР\nИ АЗРИЭЛЯ.",
    "уникальных листьях": "УНИКАЛЬНЫЕ ЛИСТЬЯ\nПРЕДНАЗНАЧЕНЫ\nТОЛЬКО\nДЛЯ ДЕСЕМБЕР\nИ АЗРИЭЛЯ.",
}

matches_triggers = {
    "test": "ТЕСТ ПРОЙДЕН.",
    "тест": "ТЕСТ ПРОЙДЕН.",
    "бот": "НА МЕСТЕ.",
    "гастер": "НА МЕСТЕ.",
    "гасир": "НА МЕСТЕ.",
    "гасер": "НА МЕСТЕ.",
    "гасёр": "НА МЕСТЕ.",
    "гастур": "НА МЕСТЕ.",
    "гангстер": "НА МЕСТЕ.",
    "эггстер": "Я НЕ ЯЙЦО.",
    "гастрит": "МЕНЯ\nНЕ ТАК ЗОВУТ.",
    "любитель подрочить в тени": "НА МЕС\n\nЭМ.\nНЕ НА МЕСТЕ.\nЭТО НЕ Я.\nНЕ ДОКАЖЕШЬ.",
    "что с ирисом": "ГАСТЕР\nМОМЕНТ.",
    "ирис сдох": "ГАСТЕР\nМОМЕНТ.",
    "гастер ссылка на рп": "НАШ СЕРВЕР:\nhttps://www.roblox.com/share?code=b01c5b9a6e97114ea80908cc1225e39d&type=Server",
    "гастер ссылка на рб": "НАШ СЕРВЕР:\nhttps://www.roblox.com/share?code=b01c5b9a6e97114ea80908cc1225e39d&type=Server",
    "гастер рб": "НАШ СЕРВЕР:\nhttps://www.roblox.com/share?code=b01c5b9a6e97114ea80908cc1225e39d&type=Server",
    "!снимаю полномочия": "ЭТО БЫЛО\nБОЛЬШОЙ\nОШИБКОЙ.\n\nНА ВСЯКИЙ СЛУЧАЙ\nНАПОМНЮ\nКАК ПОФИКСИТЬ.\n\n!восстановить создателя"
}


admin_action_triggers = {
    "варн": "КАК ЖАЛЬ ЧТО\nУЧАСТНИКИ ЭКСПЕРИМЕНТА\nРУШАТ ЕГО ПОРЯДОК.",
    "снять варн": "ОЧЕНЬ ИНТЕРЕСНОЕ ПОВЕДЕНИЕ.",
    "мут": "КАЖЕТСЯ, КТО-ТО СОРВАЛ ГОЛОС.\nВОЗВРАЩАЙСЯ, КОГДА БУДЕШЬ,\nМММ... ПОСПОКОЙНЕЙ.",
    "бан": "НЕКОТОРЫМ\nК СОЖАЛЕНИЮ\nЛУЧШЕ НЕ УЧАВСТВОВАТЬ В ЭКСПЕРИМЕНТЕ."
}

channel_post_triggers = {
    "загор": "КАКАЯ ИНТЕРЕСНАЯ\nТЕОРИЯ.\n\"ЗАГОР\".\n\nМНЕ С НИМ\nЕЩЁ ПРЕДСТОИТ\nПОВИДАТЬСЯ."
}